wetSteamFoam/test/0/wetness
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      w;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    Default_Boundary_Region
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.05;
    }

    outlet
    {
        type            inletOutlet;
        value           uniform 0;
        inletValue      uniform 0.01;
    }
}

// ************************************************************************* //
