wetSteamFoam/test/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-11;
        relTol          0.001;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "(U|h|k|omega)"
    {
        solver          PBiCG;
	preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.001;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 1;
    //rhoMin          rhoMin [1 -3 0 0 0] 0.1;
    //rhoMax          rhoMax [1 -3 0 0 0] 2.0;
    transonic       yes;
}

relaxationFactors
{
  fields
    {
      p               0.3;
      rho             0.05;
    }
  equations
    {
      U               0.7;
      "(k|epsilon|omega)"   0.7;
      "(e|h)"         0.5;
    }
}


// ************************************************************************* //
